Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །དབང་པོ་དྲུག་གི་གྲོང་ཁྱེར་གནས་རྣམས་རབ་འཇོམས་པ།
en: He defeats those who live in the city of the six sense faculties

source: །དོན་མཆོག་དྲན་པ་དྲུག་གི་ཁ་ལོ་སྒྱུར་དབང་པོ།
en: And is the lord of guides recalling the six supreme goals.”

source: །ཕ་རོལ་ཆོས་དྲུག་མཆོག་རྣམས་རབ་ཏུ་བཤད་པའི་ཕྱིར། །དྲུག་གི་ས་བོན་སྨྲ་བའི་སེང་གེ་འདིར་གཤེགས་སོ། །འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་རིས་དྲུག་གི་བར་དུ་པད་མ་དེ་ལས་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་།
en: The following stanzas, also emanating from the lotus , could be heard as far as the realms of the six classes of the gods of desire.

source: །ཁྱེད་ཅག་ཚོགས་ཏེ་དེ་རིང་དགའ་བ་སྤྱོད།
en: “You now indulge in every possible pleasure

source: །བག་མེད་སེམས་པ་སྲིད་དང་རྒྱགས་པས་བསྒྲིབས།
en: With careless minds, obscured by craving and self-aggrandizement.

source: །རྟག་ཏུ་རྨོངས་ཤིང་དགའ་བའི་སྐོམ་གྱིས་མྱོས།
en: You are always beguiled and intoxicated by the drink of pleasure.

source: །བག་མེད་གྱུར་པས་བདེ་གཤེགས་མཆོད་མི་བྱེད།
en: Because of your heedlessness, you do not worship the Blissful One.

source: །འདོད་པ་མི་རྟག་ཆུ་ཡི་ཟླ་བ་བཞིན།
en: “Sensual enjoyments are ephemeral like reflections of the moon in water.

source: །སྐྱེ་དགུའི་འཁོར་བའི་ཞགས་པ་ཤིན་ཏུ་སྲ།
en: The noose of saṃsāra, binding all beings, is extremely strong.

source: །དགའ་བ་དག་ལ་བག་མེད་མ་ཐར་བ།
en: Those not freed from it, distracted by pleasures,

source: །ནམ་ཡང་མྱ་ངན་འདའ་བར་མི་འགྱུར་རོ།
en: Will never reach nirvāṇa.

source: །རྟག་ཏུ་བག་མེད་ཞི་བའི་ཕྱིར་མི་འཇུག །དགེ་དང་མི་དགེ་སྔོན་བྱས་མ་མཐོང་ངམ།
en: “Always distracted, you do not practice mental tranquility And do not see what you did in the past as virtuous or unvirtuous.

source: །རྒ་དང་ན་འཆིའི་འཇིགས་པས་ཀུན་ཟིན་ཅིང་།
en: You will be seized with the fear of aging, disease, and death,

source: །ཁྱེད་ཅག་ངན་སོང་ས་ལ་རབ་ཏུ་ཞུགས།
en: And someday will have to descend to the lower realms.

source: །སྦྱིན་དང་དུལ་དང་ཀུན་སྡོམ་བག་ཡོད་ལ།
en: “You should practice generosity, self-control, restraint, and nondistraction

source: །སྟེན་ཅིག་སྔོན་གྱི་ལེགས་བྱས་རྣམས་ཀྱང་སྲུངས།
en: And guard your previously accumulated merit.

source: །འདོད་པ་མི་གཙང་མཐའ་མེད་ཀུན་སྤོངས་ལ།
en: You should give up impure sensual desires, which are endless,

source: །བདེ་བར་གཤེགས་པའི་སྐྱབས་སུ་ཉེ་བར་དོང་།
en: And instead approach the Blissful One for refuge.

source: །སོང་སྟེ་དེ་ཡི་བཀའ་ལ་རབ་ཏུ་ཉོན།
en: “You should go to him and listen to his teaching,

source: །ལེགས་བཤད་དེ་ནི་ཁྱོད་ཀྱི་དོན་ཆེན་ཏེ།
en: Which is eloquent, rich in meaning,

source: །ཤེས་རབ་རྣམ་གྲོལ་རབ་ཏུ་ཞི་བའི་རྒྱུ།
en: And the cause of knowledge, liberation, and peace.

source: །དམ་པའི་ཆོས་ལྡན་མཉན་པ་དོན་ཆེན་ནོ།
en: There is great value in listening to him who possesses the sacred Dharma.

source: །གཟུགས་ན་སྤྱོད་པའི་ལྷའི་རིས་བཅུ་དྲུག་གི་བར་དུ་པད་མ་དེའི་འདབ་མ་ལས་ཚིགས་སུ་བཅད་པ་འདི་ལྟ་བུ་འདི་དག་བྱུང་ངོ་།
en: The following stanzas, also emanating from the lotus, could be heard as far as the sixteen desire god realms. “You should cultivate the Dharma assiduously

source: །མཉམ་གཞག་བསམ་གཏན་དགའ་བ་ཉོན་མོངས་མེད། །རབ་ཏུ་བསྒྲིམས་ཏེ་ཆོས་ལ་རྣམ་པར་བསྒོམས།
en: And delight in one-pointed contemplation, eliminating the afflictions.

source: །མ་འཁྲུལ་སེམས་དང་རྣམ་པར་ཐར་འདོད་པས།
en: Undistracted in mind and longing for liberation,

source: །ཞེ་སྡང་རབ་ཏུ་སྤངས་པའི་བློ་གྱིས་ཤིག །རྣམ་པ་བཅུ་གསུམ་མཚན་མ་བསྟན་པ་ཡི།
en: You will find an intelligence that relinquishes hatred.

source: །བཟོད་པ་མཆོག་ལ་རྣམ་པར་བསྒོམ་པར་གྱིས།
en: You should cultivate the supreme acceptance, The elucidation of the signs of the thirteen aspects.

source: །དེས་ནི་ན་དང་རྒ་ལས་ཐར་བ་ཡི། །ཤིན་ཏུ་རྣམ་ཐར་མྱུར་དུ་ཐོབ་པར་འགྱུར།
en: Only through acceptance will you swiftly Obtain ultimate liberation, free from disease and old age.

source: །གང་རྣམས་གཟུགས་ཀྱི་རྣམ་རྟོག་སྲོག་ལ་ཆགས།
en: “For those who put their faith in a multitude of forms and ideas

source: །ཐེར་ཟུག་རྟག་པ་བདག་བརྟན་དངོས་པོར་ལྟ།
en: And see things as lasting, stable, and truly existent,

source: །དེ་དག་གི་ནི་སྐྱེ་བའི་རྒྱུན་མི་འཆད།
en: There will be no severance of the stream of rebirths.

source: །དེ་རྣམས་ངན་སོང་ས་ལ་ཤིན་ཏུ་འབབ།
en: They are destined for the lower realms.

source: །རྟག་ཏུ་ཁམས་གསུམ་བདག་མེད་རྫས་མེད་ཅིང་།
en: “But those who have ascertained the three realms to be selfless,

source: །བྱེད་མེད་རང་དབང་མེད་པར་རྣམ་བལྟས་ནས།
en: Insubstantial, non-independent, and inactive

source: །རྗེས་སུ་འཐུན་པའི་བཟོད་པ་གང་སྒོམ་པ།
en: And who cultivate the acceptance of phenomena concurring with reality

source: །དེ་དག་འགྲོ་བ་ཀུན་ལས་ཐར་བར་འགྱུར། །སྐྱེ་དང་འཇིག་འགྲོལ་ཆོས་འདི་ཐམས་ཅད་ལ། །ནམ་མཁའ་འདྲ་བར་གང་རྣམས་སྒོམ་བྱེད་པ།
en: Will all be liberated from the course of their rebirths.

source: །དེ་དག་འཆི་མེད་རྒ་མེད་ན་བའང་མེད།
en: “There will be no death, aging, sickness,

source: །ངན་འགྲོ་མེད་ཅིང་མི་སྡུག་ཕྲད་པའང་མེད།
en: Unhappy rebirth, or meeting with anything unpleasant

source: །གང་རྣམས་དབང་པོ་དག་ལ་ཡིད་མི་ཆགས།
en: For those who meditate on all the phenomena in this world As being equal to the sky, free from arising and destruction.

source: །ལམ་དེ་མཆོག་སྟེ་ཤིན་ཏུ་དག་པ་ཡིན། །ད་ལྟར་ཤཱཀྱ་སེང་གེ་འདི་བཞིན་དུ།
en: “This path is infinitely pure and is sublime. Those whose minds are not caught up in the senses

source: །བདུད་རྣམས་བཞི་པོ་རྣམ་པར་འཇོམས་པར་འགྱུར།
en: Will defeat the four types of māras,

source: །གང་དག་གཡོ་བ་བཏུལ་ནས་གཉིས་སྤང་ཕྱིར།
en: Just as did the lion of the Śākyas. “This supreme path is taught For those who cultivate the single principle

source: །ཅི་ཡང་མེད་ཅིང་མཚན་མ་ཀུན་སྤངས་པ།
en: That relinquishes sheer absence and all signs,

source: །ཚུལ་གཅིག་རྣམ་པར་སྒོམ་པར་བྱེད་པ་རྣམས།
en: And for those who train in behavior in order to abandon duality.

source: །དེ་དག་ལ་ནི་ལམ་མཆོག་འདི་བཤད་དོ།
en: “Those who meditate on all phenomena in this world as empty,

source: །བདག་པོ་མེད་ཅིང་བྱེད་པ་མེད་གྱུར་པར། །ཆོས་འདི་ཐམས་ཅད་སྟོང་པར་བསྒོམས་ནས་སུ། །སྨོན་པ་སྤངས་ན་བླ་ན་མེད་པ་ཡི།
en: Being without agent and without action,

source: །བྱང་ཆུབ་ནམ་མཁའི་རང་བཞིན་རེག་པར་འགྱུར།
en: Will directly experience the awakening of the sky-like nature, Unequaled and devoid of expectation.”

source: །དེ་ལྟ་བུའི་དོན་གྱི་ཚིག་གིས་ཆོས་ཀྱི་སྒྲ་དེ་དག་བྱུང་བས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་མི་དང་མི་མ་ཡིན་པ་དེ་དག་ཚོགས་ཏེ། སྲང་གི་དབུས་ན་པད་མ་དེ་འཁོར་བར་འདུག་གོ།
en: While these expressions of the Dharma, pregnant with meaning, were issuing forth from the lotus , the human and nonhuman beings present in this world sphere gathered together in the middle of the street and took their seats around the lotus

source: །འོག་མིན་གྱི་ལྷ་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་བར་དུ་འོག་མིན་ནས་བབས་ནས་ཆོས་མཉན་པའི་ཕྱིར་པད་མ་དེའི་ཁོར་ཡུག་ཏུ་འཁོད་དོ།
en: They included many beings up to the countless Akaniṣṭha gods, who descended from their realm in infinite numbers and took their seats around the lotus to hear the Dharma.

source: །བདུད་སྡིག་ཅན་གྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་ཐོས་ནས་ཀུན་ཏུ་བལྟས་ཏེ།
en: The same stanzas were overheard by Māra , the evil one.

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྲང་གི་དབུས་ན་པད་མ་དེ་ལས་འདི་ལྟ་བུའི་ཚིགས་སུ་བཅད་པ་དག་བྱུང་སྟེ། ཆོས་མཉན་པའི་ཕྱིར་མི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་པད་མ་དེ་འཁོར་བར་འཁོད་པ་མཐོང་ངོ་།
en: Looking around, he saw, in the middle of the street in the great city of Rājagṛha, the lotus from which these stanzas were issuing and, seated around the lotus to hear the Dharma, infinite hundreds of thousands of millions of people.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་སྟེང་དུ་བལྟས་ན་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་དྲུག་གི་གནས་ཐམས་ཅད་ན་ཡང་ཆོས་མཉན་པའི་ཕྱིར་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་པད་མ་དེ་འཁོར་བར་འཁོད་པ་མཐོང་ངོ་།
en: He then looked up and saw the same lotus in every abode of the gods throughout the six realms of desire. Those lotuses too were surrounded by infinite numbers of hundreds of thousands of millions of gods, seated in order to hear the Dharma.

source: །དེ་ནས་བདུད་སྡིག་ཅན་རབ་ཏུ་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ནས་ཡིད་ལ་གཅགས་ཏེ། སྤུ་ཟིང་ཞེས་བྱེད་པར་གྱུར་ཅིང་།
en: Consequently, Māra , the evil one, became even more frustrated, upset, and dejected.

source: ལུས་རྔུལ་ཏེ་ལུས་འདར་ནས་ནམ་མཁའ་ལ་རྒྱུག་ཅིང་སྐད་ཆེན་པོས་བོས་ཏེ་བདུད་གཞན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Covered in goosebumps and sweat, shivering, he flew up into the sky and, in a loud voice, angrily addressed the other māras:

source: །མི་འགྱུར་ཡིད་ཀྱིས་ང་ཡི་ཚིག་ཉོན་ལ།
en: “Listen to my out-of-character speech attentively!

source: །ང་ལ་སྟོབས་མེད་བདག་ཡུལ་འདིར་དབང་མེད།
en: I have no control over my dominion anymore, and no power in this world.

source: །ཐུབ་སྟོབས་ཡོན་ཏན་ཤིན་ཏུ་དྲི་མེད་དེ།
en: The power of this sage and his immaculate qualities

source: །སྐྱེ་བོ་བརྟན་ཕྱིར་འཇིག་རྟེན་འདིར་འདུག་གོ།
en: Spread throughout this world, confirming beings in their allegiance to him.

source: །ལྷ་མི་དགའ་བའི་དམ་པ་འདིར་བྱུང་སྟེ།
en: “And furthermore, a lotus has sprung up to delight humans and gods.

source: །འགྲོ་མཆོག་མ་ལུས་ངེས་པར་ཉེ་བར་དོང་།
en: All the good people have come to it, well disciplined

source: །བདེ་གཤེགས་ཚིག་ལ་སྐོམ་ཞིང་རབ་ཏུ་དགའ།
en: And eager to savor the fine teachings of the Blissful One.

source: །ཡོན་ཏན་རབ་མཆོག་ཞི་བའི་ལམ་དུ་འགྲོ།
en: Full of extraordinary qualities, they follow the path of calming the mind.

source: །འདི་ནི་འཇིག་རྟེན་གསུམ་པོ་སླུ་བ་དགེ་སྦྱོང་སྒྱུ་ཡིན་ཏེ།
en: “The magical illusion unleashed by this monk fools this entire threefold universe.

source: །ལྷ་མི་མང་པོ་ཐམས་ཅད་ཡིད་གཅིག་པད་མ་འཁོར་བར་འདུག །ད་ནི་འཇིགས་པའི་སྐད་ཕྱུང་མྱུར་དུ་རི་ཡི་ཆར་ཕོབ་སྟེ།
en: The multitudes of humans and gods, fully attentive, stand around the lotus . Quickly cast down a rain of rocks along with terrifying cries!

source: །ཅི་ནས་བདུད་ཀྱི་སྡེ་བཙན་མཚོན་གྱིས་དེང་བཅོམ་འདིར་བརླག་གྱིས།
en: He will perish today, if attacked by the fierce soldiers of Māra

source: །དེ་ནས་བདུད་གཞན་ཞིག་གིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Another māra said to the evil one:

source: །བདག་གི་ཕན་བྱེད་ཚིག་འདི་ཉོན་ཅིག་ཁྱོད་ཀྱི་ཆོས་རིག་ན།
en: “Listen to this beneficial advice from us. Do you really understand what your duty is

source: །བདག་སྡེ་བརླག་པ་མཐོང་ཡང་ཞི་བར་ཅི་ཡི་ཕྱིར་མི་འགྲོ།
en: If, even though you’ve seen the ruin of your army, you still don’t want to make peace?

source: །བདེ་གཤེགས་གཟི་བརྗིད་སྐུ་དང་དཔལ་འཆང་གཟུགས་མཐོང་བདག་ཅག་མྱོས།
en: It is we who are in error, considering that the splendorous body of the Blissful One is a receptacle of good fortune,

source: །སངས་རྒྱས་འདྲེན་པ་མ་གཏོགས་འདི་ན་སྐྱབས་རབ་མཆོག་གཞན་མེད།
en: And that apart from the Buddha—a guide in truth—there is no other refuge in this world so exalted.”

source: །དེ་ནས་བདུད་གཞན་ཞིག་རབ་ཏུ་ངུ་ཞིང་གདོང་མཆོག་ཏུ་ཁྲོ་བས་ནོན་པས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then another māra, lamenting loudly, his words full of utmost indignation, said this to Māra , the evil one:

source: །ལོག་པའི་ལམ་དུ་ཞུགས་ཤིང་ལམ་དམན་པ།
en: “You have lost your way and are on a lowly course!

source: །བདག་གི་སྟོབས་མཐུ་མེད་པའང་མི་ཤེས་སམ།
en: Don’t you know that we have no such strength or might?

source: །འདྲེན་པ་ལ་ཡང་གང་ཕྱིར་ཁྱོད་སྡོ་བ། །ངོ་མི་ཚ་འམ་འཛེམ་པར་མི་བྱ་འམ།
en: Have you no shame and no compunction, That you are competing against the Guide?

source: །བདག་ཅག་སྟོབས་ནི་ཤིན་ཏུ་བརླག་པར་འགྱུར།
en: “While our force has been ruined,

source: །སངས་རྒྱས་མཐུ་ཡིས་འགྲོ་བ་མ་ལུས་པ།
en: All the world’s inhabitants, through the power of the Buddha,

source: །པད་མའི་དྲུང་དུ་ཉེ་བར་དེར་འདོང་སྟེ།
en: Have been drawn near the lotus

source: །ཆོས་ཐོས་ཚིམ་པས་ལུས་ཀྱང་ཤིན་ཏུ་དག །བདག་ཅག་རྣམ་པར་འཇིགས་ཤིང་སྐྲག་གྱུར་ཏེ།
en: Their pure bodies nourished by hearing the Dharma. “We, on the other hand, have become repulsive;

source: །ལུས་ནི་དྲི་ང་སྟོབས་དང་བརྩོན་འགྲུས་སྟོར། །ཅི་ཙམ་སྐད་ཅིག་བརླག་པར་མ་གྱུར་པ།
en: Our bodies stink and our strength and valor are gone.

source: །དེ་ཡི་བར་དུ་ཐུབ་དབང་སྐྱབས་སུ་འདོང་།
en: We should take refuge with the lord of sages, So that we don’t perish immediately.”

source: །དེ་ནས་བདུད་གཞན་ཞིག་གིས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Other māras said with folded hands:

source: །སྡིག་ཅན་ཁྱོད་ནི་ཆོས་ཀྱི་སྤྱོད་པ་སྤངས་ཤིང་སྡིག་བྱེད་དགའ།
en: “You, O evil one, have given up right conduct and delight in evil acts,

source: །སངས་རྒྱས་མགོན་འདི་འགྲོ་བའི་ཕན་དོན་མཁས་ཤིང་དགེ་བའི་མཆོག །གྲོང་ཁྱེར་འདིར་བྱོན་བདག་ཅག་མྱུར་དུ་དགའ་ཞིང་དང་བས་བལྟ།
en: But the Buddha is the protector skilled in bringing benefit to beings, the best among the good. We should promptly go to the city of Rājagṛha, putting on a pleasant and peaceful appearance.

source: །འཇིག་རྟེན་གསུམ་མཆོད་སྲོག་ཆགས་ཀུན་གྱི་སྨན་ལ་སྐྱབས་སུ་འདོང་།
en: Let us go for the refuge that is revered by the threefold universe—a universal medicine for all beings!”

source: །དེ་ནས་ནམ་མཁའ་དེ་ཉིད་ནས་བདུད་དབྱངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བ་དེས་སྒྲ་ཆེན་པོར་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: There was a māra there in the sky called Ghoṣavati. He proposed in a loud voice:

source: །ཁྱེད་ཀུན་ཚོགས་པས་གུས་ཤིང་དགའ་ལྡན་ང་ཡི་ཚིག་ཉོན་ཅིག །སྡིག་པའི་ལྟ་བ་ཀུན་བཟློག་ལུས་བཏུད་ངག་ཡིད་འཐུན་སྤྱོད་དེ།
en: “All of you together, please listen to my words in a spirit of devotion and friendliness. Let us renounce our wrong views, bow down to him, and likewise pay homage with speech and mind.

source: །ཁྲོ་སྤངས་རབ་དགའ་ཐུབ་པའི་གསུང་མཆོག་ལ་ཡང་དགའ་དད་བསྐྱེད།
en: Having renounced anger, may we be thrilled by the teachings of the Sage, with feelings of devotion and faith welling up in us.

source: །སངས་རྒྱས་མངོན་སུམ་རྙེད་དཀའ་སྐྱབས་དོང་དེ་རིང་གུས་པར་མཆོད།
en: Let us go to the Buddha in person to seek the refuge so difficult to obtain; let us worship him today with devotion.”

source: །དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་བདུད་ཐམས་ཅད་ནམ་མཁའ་ལས་བབས་ནས། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་གྱི་སྒོ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་ཏེ།
en: At this moment all the māras descended from the sky and constructed gates to the city of Rājagṛha from the seven gems.

source: བདུད་ལ་ལ་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ཆ་བྱད་དུ་བདག་ཉིད་མངོན་པར་སྤྲུལ་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ཕྱིར་འབད་ཅིང་འཁོད་དོ། །ལ་ལ་ནི་ཚངས་པའི་ཆ་བྱད་དུ། ལ་ལ་ནི་དབང་བྱེད་ཀྱི་ཆ་བྱད་དུ། ལ་ལ་ནི་དབང་ཕྱུག་ཆེན་པོའི་ཆ་བྱད་དུ།
en: Some, taking on the appearance of universal monarchs, stood in front of the Blessed One, making every effort to worship him.

source: ལ་ལ་ནི་སྲེད་མེད་ཀྱི་བུའི་ཆ་བྱད་དུ། ལ་ལ་ནི་དགའ་ལྡན་པའི་ཆ་བྱད་དུ། ལ་ལ་ནི་འཐབ་བྲལ་བའི་ཆ་བྱད་དུ། ལ་ལ་ནི་བརྒྱ་བྱིན་གྱི་ཆ་བྱད་དུ། ལ་ལ་ནི་སུམ་ཅུ་རྩ་གསུམ་པའི་ཆ་བྱད་དུ། ལ་ལ་ནི་གཞོན་ནུའི་ཆ་བྱད་དུ།
en: Some took on the appearance of Brahmā, some of Vaśavartin, some of Maheśvara, some of Nārāyaṇa, some of a Tuṣita god, some of Yāma, some of Śakra, and some of a god from the realm of the Thirty-Three.

source: ལ་ལ་ནི་རྣམ་ཐོས་ཀྱི་བུའི་ཆ་བྱད་དུ། ལ་ལ་ནི་འཕགས་སྐྱེས་པོའི་ཆ་བྱད་དུ། ལ་ལ་ནི་མིག་མི་བཟང་གི་ཆ་བྱད་དུ། ལ་ལ་ནི་ཡུལ་འཁོར་སྲུང་གི་ཆ་བྱད་དུ། ལ་ལ་ནི་རྒྱལ་ཆེན་བཞི་པ་ཕལ་པའི་ཆ་བྱད་དུ།
en: Some took on the form of Kumāra, Vaiśravaṇa, Virūḍhaka, Virūpākṣa, or Dhṛtarāṣṭra, and some, the form of the mundane Four Great Kings. Some took on the appearance of Sūrya, Candra, or Tāraka;

source: ལ་ལ་ནི་ཉི་མའི་ཆ་བྱད་དུ། ལ་ལ་ནི་ཟླ་བའི་ཆ་བྱད་དུ། ལ་ལ་ནི་སྐར་མའི་ཆ་བྱད་དུ། ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་ཆ་བྱད་དུ། ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་ཆ་བྱད་དུ། ལ་ལ་ནི་མིའམ་ཅིའི་ཆ་བྱད་དུ།
en: some, the appearance of an asura, garuḍa, kinnara, or mahoraga;

source: ལ་ལ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་ཆ་བྱད་དུ། ལ་ལ་ནི་རིན་པོ་ཆེའི་ཆ་བྱད་དུ། ལ་ལ་ནི་གསེར་གྱི་རྒྱན་གྱི་ཆ་བྱད་དུ། ལ་ལ་ནི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆ་བྱད་དུ། ལ་ལ་ནི་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་ཆེན་པོའི་ཆ་བྱད་དུ།
en: and some, the appearance of jewel mountains, golden ornaments, various gems, or jeweled trees.

source: ལ་ལ་ནི་རྒྱལ་རིགས་ཀྱི་ཆ་བྱད་དུ།
en: Some took on the appearance of a kṣatriya;

source: ལ་ལ་ནི་གཞན་མུ་སྟེགས་ཅན་གྱི་ཆ་བྱད་དུ།
en: some, the appearance of members of religions other than Buddhism;

source: ལ་ལ་ནི་འཁོར་ལོ་རིན་པོ་ཆེའི་ཆ་བྱད་དུ། ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེའི་ཆ་བྱད་དུ། ལ་ལ་ནི་གླང་པོ་རིན་པོ་ཆེ་ས་སྲུང་གི་བུའི་ཆ་བྱད་དུ། ལ་ལ་ནི་རྟའི་རྒྱལ་པོ་སྤྲིན་གྱི་ཤུགས་ཅན་གྱི་ཆ་བྱད་དུ། ལ་ལ་ནི་བུད་མེད་རིན་པོ་ཆེའི་ཆ་བྱད་དུ།
en: some, the appearance of the precious wheel, the precious jewel, the elephant Airāvaṇa, Bālāha the king of steeds, or the precious consort;

source: ལ་ལ་ནི་ཚོང་དཔོན་བཙུན་པའི་ཆ་བྱད་དུ། ལ་ལ་ནི་བློན་པོ་རིན་པོ་ཆེའི་ཆ་བྱད་དུ་བདག་ཉིད་མངོན་པར་སྤྲུལ་ཏེ།
en: and some, the appearance of a respected merchant or a royal minister.

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་འཁོད་དོ།
en: Magically transformed into these forms, they stood in front of the Blessed One in order to worship him.

source: །ལ་ལ་ནི་སྔོ་ཞིང་ཁ་དོག་སྔོ་ལ་ཕྱང་འཕྲུལ་དང་། རྒྱན་དཀར་པོས་བརྒྱན་པར་བདག་ཉིད་མངོན་པར་སྤྲུལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དམར་པོ་དང་། མུ་ཏིག་གི་ཕྲེང་བ་ཐོགས་ཤིང་འཕང་དུ་ཏ་ལའི་སྲིད་ཙམ་གྱི་ནམ་མཁའི་དཀྱིལ་ན་འཁོད་དོ།
en: Some of them, who were blue with a blue complexion, magically adorned their bodies with white ornaments. In order to worship the Blessed One they floated in the sky at the height of a palm tree, holding red parasols, banners, flags, and strings of pearls.

source: །ལ་ལ་ནི་དཀར་ཞིང་ཁ་དོག་དཀར་ལ་ཕྱང་འཕྲུལ་དང་། སྤུད་པ་ཁ་དོག་ལེ་བརྒན་ཏེ་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སེར་པོ་དང་། མུ་ཏིག་གི་ཕྲེང་བ་ཐོགས་ཤིང་འཁོད་དོ། །ལ་ལ་ནི་ལེ་བརྒན་ཁ་དོག་ལེ་བརྒན་ལ་གསེར་གྱི་གོས་དང་། ཕྱང་འཕྲུལ་དང་། ལྷབ་ལྷུབ་སྟེ།
en: Some were dazzling white with a white complexion and adorned with bright red ornaments; they floated in the sky holding yellow parasols, banners, flags, and strings of pearls. Some were bright red with a red complexion and adorned with ornaments of a golden color.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མཐིང་ག་ཐོགས་ཤིང་འཁོད་དོ།
en: They floated aloft, holding blue parasols, banners, and flags.

source: །ལ་ལ་ནི་དམར་ཞིང་ཁ་དོག་དམར་ལ་མུ་ཏིག་དཀར་པོའི་ཆར་འབེབས་སོ།
en: Some were red with a red complexion and rained down white pearls.

source: །ལ་ལ་ནི་དཀར་ཞིང་ཁ་དོག་དཀར་ལ་མུ་ཏིག་དམར་པོའི་ཆར་འབེབས་སོ།
en: Some were white with a white complexion and rained down red pearls.

source: །ལ་ལ་ནི་ལྷའི་དྲང་སྲོང་གི་ཁ་དོག་ཏུ་བདག་ཉིད་མངོན་པར་སྤྲུལ་ནས། ནམ་མཁའ་ལས་མེ་ཏོག་གི་ཆར་མངོན་པར་འབེབས་སོ།
en: Some, magically appearing as celestial ṛṣis, rained flowers from the sky in great profusion.

source: །ལ་ལ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་གཟུགས་སུ་མངོན་པར་སྤྲུལ་ནས། ནམ་མཁའ་ལས་ལྷའི་སྤོས་སྣ་ཚོགས་ཀྱི་ཆར་འབེབས་སོ།
en: Some, appearing as the Blessed One’s hearers, rained divine fragrances of various kinds from the sky.

source: །ལ་ལ་ནི་དྲི་ཟའི་ཁ་དོག་གིས་ལྷའི་སིལ་སྙན་སྣ་ཚོགས་རྡུང་ངོ་།
en: Some, appearing as gandharvas, strummed various divine instruments.

source: །ལ་ལ་ནི་ལྷའི་བུ་མོའི་ཁ་དོག་གིས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྣོད་དུ་སྤོས་ཆུ་ཐོགས་ཏེ་ས་ལ་ཆག་ཆག་འདེབས་སོ།
en: Some, appearing as celestial nymphs, sprinkled the ground with perfumed water from vessels made of various gems.

source: །ལ་ལ་ནི་མཆིང་བུ་ནག་པོ་ལྟ་བུའི་ཁ་དོག་སྟེ་སྤོས་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བདུག་པར་བྱེད་དོ།
en: Some, of obsidian-black complexion, burned incense of various fragrances.

source: །ལ་ལ་ནི་ལྷའི་བུའི་ཆ་བྱད་ཀྱིས་གར་བྱེད་ཅིང་གླུའི་དབྱངས་འབྱིན་ཏོ།
en: Some, appearing as gods, danced and sang.

source: །ལ་ལ་ནི་ཁ་དོག་སྣ་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་བསྟོད་དོ།
en: Some, of varying complexion, praised the Blessed One with their folded hands directed toward him.

source: །བདུད་དང་བདུད་ཀྱི་འཁོར་ལ་ལ་ནི་བཅོམ་ལྡན་འདས་ཕྱོགས་ག་ལ་བཞུགས་པ་དེ་ལོགས་སུ་མངོན་པར་ཕྱོགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཐོགས་སོ།
en: Some māras, and even their retinues, turned to face the direction where the Blessed One resided and, holding various jewels, offered them to him in worship.

source: །ལ་ལ་ནི་སྲང་དང་། ཁང་པ་དང་། ཁྱིམ་དང་། སྐར་ཁུང་དང་། རྟ་བབས་དང་། བསིལ་ཁང་དང་། ལམ་གྱི་བཞི་མདོ་དང་། སུམ་མདོ་དང་། ཁང་པ་བརྩེགས་པ་དང་། སྒོ་ཁང་དང་། ཤིང་ཁང་དང་། གཞལ་མེད་ཁང་རྣམས་ན་འདུག་ཅིང་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་འཁོད་དོ།
en: Some, having placed themselves by the upper windows of houses and buildings along the street or upon gateways, tall buildings, houses at crossroads of three or four roads, gates, trees, or palaces, were sitting there for the purpose of worshiping the Blessed One.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་གང་གི་ཚེ་བདུད་དེ་དག་ཐམས་ཅད་གཡོག་དང་བཅས་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་སྐྱབས་སུ་དོང་བར་མཐོང་བ་དེའི་ཚེ།
en: When Māra , the evil one, saw all those māras with their retinues going for refuge in the monk Gautama, he became even more rattled, frightened, and confused.

source: རབ་ཏུ་འཁྲུགས་ཏེ་སྐྲག་ཅིང་མྱོས་ནས་རབ་ཏུ་ངུ་ཞིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Wailing aloud, he said:

source: །བདག་ལ་ཕྱིན་ཆད་གྲོགས་མེད་དེ།
en: “I have no friends anymore

source: །བདག་གི་དཔལ་དེང་ཐམས་ཅད་སྟོར།
en: And have today been deprived of all my glory.

source: །བདག་ནི་བདུད་ཀྱི་ཡུལ་ནས་འཁྱམས།
en: Separated now from my dominion,

source: །བརྩོན་འགྲུས་ཐ་མ་བརྩམ་པར་བྱ།
en: I will make my final effort.

source: །བདག་གིས་པད་མ་རྩ་བ་བཅད། །པད་མ་བཅད་དང་ཀུན་འཁྲུགས་ཏེ།
en: “I will cut down at its root

source: །དེས་ན་སེམས་ཅན་ཕྱོགས་ཕྱོགས་འགྲོ།
en: the lotus where all the beings went. After cutting it, they will all be flummoxed—

source: །དེ་ནི་ཐ་མའི་སྟོབས་ཡིན་ནོ།
en: this will be my last stand.”

source: །བདུད་སྡིག་ཅན་གྱིས་དེ་ལྟར་བསམས་ནས་རླུང་ལྟ་བུར་ནམ་མཁའ་ལས་བབས་ཏེ། སྲང་གི་པད་མ་ག་ལ་བ་དེར་ཕྱིན་ནས་པད་མ་དེའི་སྡོང་པོ་ཡན་ཆད་དབྱུང་བར་འདོད་ན་རེག་པར་ཡང་མ་ནུས།
en: Having thus made up his mind, Māra , the evil one, descended from the sky, fast as wind, to the street where the lotus was, and, having crept up to its stalk, tried to uproot it but could not even touch it.

source: པད་མའི་འདབ་མ་བཅད་པར་འདོད་ན་དེ་དག་ཀྱང་མ་མཐོང་།
en: He tried to cut the petals but could not even see them.

source: པད་མའི་སྙིང་པོ་ལག་པས་བརྡབ་པར་འདོད་ན་དེ་ཡང་མ་དམིགས་ཏེ།
en: He also tried to smash the pericarp with his fist but could not even grasp it.

source: དཔེར་ན་གློག་སྣང་ཡང་མི་དམིགས་པ་བཞིན་ནོ། །འདི་ལྟ་སྟེ་དཔེར་ན་གྲིབ་མ་སྣང་ཡང་མི་དམིགས་པ་དེ་བཞིན་དུ་པད་མོ་དེ་ཡང་སྣང་མོད་ཀྱི་མི་དམིགས་སོ།
en: Just as lightning, or a shadow, can be seen but not grasped, in the same way he could see the lotus but not grasp it.

source: །གང་གི་ཚེ་བདུད་སྡིག་ཅན་གྱིས་པད་མ་དེ་མཐོང་ཡང་མི་དམིགས་ཤིང་རིག་པར་མི་རུང་བ་དེའི་ཚེ། འཁོར་ཐམས་ཅད་རབ་ཏུ་དངངས་པར་བྱ་བའི་ཕྱིར་སྐད་དྲག་ཅིང་ཆེ་ལ་འཇིགས་པའི་སྒྲ་དབྱུང་བར་འདོད་ན་དེ་ཡང་མ་ནུས་སོ།
en: When he thus saw the lotus without being able to touch it or seize it, he tried to let loose a most horrific deafening cry in order to frighten the entire congregation, but this too he was unable to do.

source: །ཡང་སྟོབས་ཆེན་པོའི་དྲག་ཤུལ་གྱིས་ལག་པ་གཉིས་ས་ཆེན་པོ་ལ་བརྡབས་ཏེ་རབ་ཏུ་བསྐྱོད་པར་འདོད་ན་རེག་པར་ཡང་མ་ནུས་ཏེ་མ་དམིགས་སོ།
en: He tried further, with great vehemence and force, to strike the great earth with both his hands to make it shake, but was unable, in this case too, to touch it or to seize it.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ལ་ལ་ཞིག་ནམ་མཁའ་ལ་རྡོབ་པར་འདོད་ན་མི་དམིགས་པ་དེ་བཞིན་དུ་བདུད་སྡིག་ཅན་གྱིས་མཐོང་ཡང་རེག་པར་མི་རུང་ཞིང་མ་དམིགས་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Just as someone wanting to hit the sky cannot reach it, in the same way Māra , the evil one, saw the earth but could not touch it or seize it.

source: ཅི་ནས་སེམས་ཅན་འདུས་པ་རྣམས་བརྟགས་ཏེ་སེམས་རྣམ་པར་འཁྲུགས་པར་བྱའོ་སྙམ་ན་སེམས་ཅན་དེ་དག་མཐོང་ཡང་མི་དམིགས་ཤིང་རེག་པར་ཡང་མ་ནུས་སོ།
en: He then thought, “If I could only punch the beings assembled here, or distract their minds.” But while he could see these beings, he was unable to touch or seize even one of them.

source: །དེ་ནས་བདུད་སྡིག་ཅན་རབ་ཏུ་ངུ་ཞིང་སངས་རྒྱས་ཀྱི་མཐུས་དེའི་ལུས་ཤིང་ལྗོན་པ་བཞིན་དུ་འདར་ཏེ། གདོང་མཆི་མ་ཅན་གྱིས་ཕྱོགས་བཞིར་བལྟ་ཞིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Māra, the evil one, wept bitterly. Through the power of the Buddha, his entire body shook like a tree. With a tear-streaked face he looked in the four directions and lamented:

source: །དགེ་སྦྱོང་གིས་ནི་འགྲོ་ཀུན་བསྡུ་ཕྱིར་དེ་རིང་སྒྱུ་འདི་བྱས།
en: “This miraculous feat, performed by this monk today, will attract the entire world to him.

source: །འདི་ལྟར་བདག་ནི་མདུན་འདིར་སླད་བཞིན་སྐད་ཅིག་མྱོས་པར་སོང་།
en: Because of my earlier delusion, I suddenly became dispossessed,

source: །ཡུལ་དང་རང་གི་སྟོབས་ལས་ཉམས་ཤིང་བདག་གི་སྲོག་ཀྱང་ཟད།
en: And I am now separated from my dominion, my merit, and my strength. My life is finished.

source: །དེས་བསྐྲད་བརླག་པར་མ་གྱུར་བར་དུ་བདག་གནས་མྱུར་དུ་འགྲོ།
en: Banished, I will promptly go to my abode, while I am still alive.”
